reports/033-ocaml-reason.txt
Running 1m test @ http://localhost:8080
  3 threads and 33 connections
  Thread calibration: mean lat.: 1.275ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.282ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.262ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.33ms  672.90us  11.26ms   69.08%
    Req/Sec     3.51k   274.93     6.30k    73.72%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.25ms
 75.000%    1.74ms
 90.000%    2.19ms
 99.000%    3.27ms
 99.900%    4.22ms
 99.990%    8.52ms
 99.999%   10.59ms
100.000%   11.26ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.092     0.000000            1         1.00
       0.542     0.100000        49999         1.11
       0.733     0.200000       100095         1.25
       0.904     0.300000       150082         1.43
       1.074     0.400000       199921         1.67
       1.252     0.500000       249750         2.00
       1.344     0.550000       274776         2.22
       1.438     0.600000       299649         2.50
       1.534     0.650000       324625         2.86
       1.634     0.700000       349588         3.33
       1.741     0.750000       374766         4.00
       1.798     0.775000       387078         4.44
       1.861     0.800000       399571         5.00
       1.930     0.825000       412083         5.71
       2.006     0.850000       424572         6.67
       2.093     0.875000       437122         8.00
       2.141     0.887500       443298         8.89
       2.195     0.900000       449533        10.00
       2.257     0.912500       455722        11.43
       2.329     0.925000       462036        13.33
       2.411     0.937500       468268        16.00
       2.461     0.943750       471345        17.78
       2.515     0.950000       474532        20.00
       2.575     0.956250       477631        22.86
       2.649     0.962500       480746        26.67
       2.735     0.968750       483837        32.00
       2.785     0.971875       485397        35.56
       2.841     0.975000       486956        40.00
       2.903     0.978125       488523        45.71
       2.977     0.981250       490059        53.33
       3.067     0.984375       491609        64.00
       3.121     0.985938       492409        71.11
       3.173     0.987500       493170        80.00
       3.235     0.989062       493961        91.43
       3.299     0.990625       494738       106.67
       3.375     0.992188       495505       128.00
       3.417     0.992969       495907       142.22
       3.463     0.993750       496283       160.00
       3.521     0.994531       496681       182.86
       3.585     0.995313       497075       213.33
       3.653     0.996094       497456       256.00
       3.701     0.996484       497653       284.44
       3.755     0.996875       497844       320.00
       3.823     0.997266       498041       365.71
       3.899     0.997656       498236       426.67
       3.971     0.998047       498430       512.00
       4.009     0.998242       498527       568.89
       4.055     0.998437       498628       640.00
       4.103     0.998633       498731       731.43
       4.159     0.998828       498820       853.33
       4.231     0.999023       498918      1024.00
       4.271     0.999121       498970      1137.78
       4.307     0.999219       499015      1280.00
       4.371     0.999316       499065      1462.86
       4.491     0.999414       499112      1706.67
       4.911     0.999512       499161      2048.00
       5.343     0.999561       499185      2275.56
       5.787     0.999609       499209      2560.00
       6.131     0.999658       499234      2925.71
       6.387     0.999707       499258      3413.33
       6.895     0.999756       499284      4096.00
       7.139     0.999780       499295      4551.11
       7.443     0.999805       499307      5120.00
       7.803     0.999829       499319      5851.43
       8.167     0.999854       499331      6826.67
       8.351     0.999878       499344      8192.00
       8.479     0.999890       499350      9102.22
       8.519     0.999902       499356     10240.00
       8.615     0.999915       499362     11702.86
       8.711     0.999927       499368     13653.33
       8.919     0.999939       499374     16384.00
       8.943     0.999945       499377     18204.44
       8.975     0.999951       499380     20480.00
       9.207     0.999957       499383     23405.71
       9.831     0.999963       499386     27306.67
       9.943     0.999969       499389     32768.00
       9.975     0.999973       499391     36408.89
      10.023     0.999976       499392     40960.00
      10.351     0.999979       499394     46811.43
      10.359     0.999982       499396     54613.33
      10.375     0.999985       499397     65536.00
      10.583     0.999986       499398     72817.78
      10.583     0.999988       499398     81920.00
      10.591     0.999989       499399     93622.86
      10.711     0.999991       499400    109226.67
      11.159     0.999992       499401    131072.00
      11.159     0.999993       499401    145635.56
      11.159     0.999994       499401    163840.00
      11.215     0.999995       499402    187245.71
      11.215     0.999995       499402    218453.33
      11.263     0.999996       499404    262144.00
      11.263     1.000000       499404          inf
#[Mean    =        1.332, StdDeviation   =        0.673]
#[Max     =       11.256, Total count    =       499404]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  599696 requests in 1.00m, 22.88MB read
Requests/sec:   9994.96
Transfer/sec:    390.43KB