reports/333-go.txt
Running 1m test @ http://localhost:8080
  3 threads and 333 connections
  Thread calibration: mean lat.: 1.148ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.671ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 3.627ms, rate sampling interval: 13ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.71ms    0.98ms  61.06ms   76.21%
    Req/Sec     3.55k     3.12k   10.09k    47.44%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.57ms
 75.000%    2.13ms
 90.000%    2.86ms
 99.000%    4.76ms
 99.900%    6.21ms
 99.990%   22.62ms
 99.999%   26.67ms
100.000%   61.09ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.086     0.000000            1         1.00
       0.672     0.100000        49471         1.11
       0.955     0.200000        98982         1.25
       1.184     0.300000       148552         1.43
       1.385     0.400000       197797         1.67
       1.572     0.500000       247478         2.00
       1.664     0.550000       272216         2.22
       1.760     0.600000       296704         2.50
       1.865     0.650000       321522         2.86
       1.985     0.700000       346246         3.33
       2.129     0.750000       370857         4.00
       2.211     0.775000       383319         4.44
       2.303     0.800000       395709         5.00
       2.405     0.825000       407939         5.71
       2.525     0.850000       420310         6.67
       2.671     0.875000       432813         8.00
       2.755     0.887500       438881         8.89
       2.855     0.900000       445123        10.00
       2.967     0.912500       451215        11.43
       3.097     0.925000       457473        13.33
       3.247     0.937500       463595        16.00
       3.335     0.943750       466664        17.78
       3.437     0.950000       469763        20.00
       3.555     0.956250       472848        22.86
       3.693     0.962500       475967        26.67
       3.849     0.968750       479044        32.00
       3.941     0.971875       480565        35.56
       4.047     0.975000       482137        40.00
       4.155     0.978125       483659        45.71
       4.279     0.981250       485219        53.33
       4.423     0.984375       486768        64.00
       4.499     0.985938       487534        71.11
       4.595     0.987500       488322        80.00
       4.695     0.989062       489087        91.43
       4.823     0.990625       489863       106.67
       4.967     0.992188       490608       128.00
       5.047     0.992969       491001       142.22
       5.135     0.993750       491391       160.00
       5.231     0.994531       491773       182.86
       5.339     0.995313       492157       213.33
       5.467     0.996094       492548       256.00
       5.527     0.996484       492736       284.44
       5.591     0.996875       492929       320.00
       5.663     0.997266       493129       365.71
       5.739     0.997656       493316       426.67
       5.831     0.998047       493513       512.00
       5.879     0.998242       493604       568.89
       5.955     0.998437       493704       640.00
       6.019     0.998633       493799       731.43
       6.103     0.998828       493894       853.33
       6.231     0.999023       493992      1024.00
       6.351     0.999121       494037      1137.78
       6.495     0.999219       494085      1280.00
       6.771     0.999316       494135      1462.86
       7.207     0.999414       494182      1706.67
       7.995     0.999512       494230      2048.00
       8.639     0.999561       494254      2275.56
       9.439     0.999609       494278      2560.00
      10.727     0.999658       494302      2925.71
      12.135     0.999707       494327      3413.33
      14.591     0.999756       494351      4096.00
      16.687     0.999780       494363      4551.11
      19.695     0.999805       494375      5120.00
      20.991     0.999829       494387      5851.43
      21.343     0.999854       494400      6826.67
      22.079     0.999878       494411      8192.00
      22.479     0.999890       494417      9102.22
      22.735     0.999902       494423     10240.00
      23.007     0.999915       494429     11702.86
      23.535     0.999927       494435     13653.33
      23.919     0.999939       494441     16384.00
      24.367     0.999945       494444     18204.44
      24.687     0.999951       494447     20480.00
      24.831     0.999957       494450     23405.71
      25.087     0.999963       494453     27306.67
      25.487     0.999969       494456     32768.00
      25.711     0.999973       494458     36408.89
      25.727     0.999976       494459     40960.00
      26.191     0.999979       494462     46811.43
      26.191     0.999982       494462     54613.33
      26.415     0.999985       494464     65536.00
      26.447     0.999986       494465     72817.78
      26.447     0.999988       494465     81920.00
      26.671     0.999989       494466     93622.86
      27.391     0.999991       494467    109226.67
      27.887     0.999992       494468    131072.00
      27.887     0.999993       494468    145635.56
      27.887     0.999994       494468    163840.00
      28.127     0.999995       494469    187245.71
      28.127     0.999995       494469    218453.33
      59.967     0.999996       494470    262144.00
      59.967     0.999997       494470    291271.11
      59.967     0.999997       494470    327680.00
      59.967     0.999997       494470    374491.43
      59.967     0.999998       494470    436906.67
      61.087     0.999998       494471    524288.00
      61.087     1.000000       494471          inf
#[Mean    =        1.707, StdDeviation   =        0.981]
#[Max     =       61.056, Total count    =       494471]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  592511 requests in 1.00m, 76.85MB read
  Socket errors: connect 0, read 46, write 0, timeout 0
Requests/sec:   9872.52
Transfer/sec:      1.28MB